"""
1. Создать список и заполнить его элементами различных типов данных.
Реализовать скрипт проверки типа данных каждого элемента.
Использовать функцию type() для проверки типа.
Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.
"""

my_list = [None, 6, 'Home', 0.5, True, [1, 2, 3], (10, 'jo')]
for el in my_list:
    print(type(el))






