"""
6. * Реализовать структуру данных «Товары».
Она должна представлять собой список кортежей.
Каждый кортеж хранит информацию об отдельном товаре.
В кортеже должно быть два элемента — номер товара и словарь с параметрами (характеристиками товара:
название, цена, количество, единица измерения).
Структуру нужно сформировать программно, т.е. запрашивать все данные у пользователя.
Пример готовой структуры:
[
(1, {“название”: “компьютер”, “цена”: 20000, “количество”: 5, “eд”: “шт.”}),
(2, {“название”: “принтер”, “цена”: 6000, “количество”: 2, “eд”: “шт.”}),
(3, {“название”: “сканер”, “цена”: 2000, “количество”: 7, “eд”: “шт.”})
]
Необходимо собрать аналитику о товарах. Реализовать словарь, в котором каждый ключ — характеристика товара,
например название, а значение — список значений-характеристик, например список названий товаров.
Пример:
{
“название”: [“комп
ьютер”, “принтер”, “сканер”],
“цена”: [20000, 6000, 2000],
“количество”: [5, 2, 7],
“ед”: [“шт.”]
}
"""

rating = [9, 6, 4, 4, 2]

i = 0

while True:
    user_number = (input('Введите натуральное число:\n>>> '))
    if user_number.isdigit():
        user_number = int(user_number)
        break
    print('Вы ввели не чило. Введите натурально число.')

while True:
    if user_number in rating:
        pos_num = rating.index(user_number)
        rating.insert(pos_num, user_number)
        break
    elif user_number not in rating:
        len(rating) - 1 > user_number
        rating.insert(i, user_number)
        break

print(rating)

"""
    elif user_number > rating[i]:
        rating.insert(i, user_number)
        break
    elif i < len(rating) - 1:
        i += 1
        continue
    else:
        rating.append(user_number)
        break

print(rating)
"""