"""
4. Пользователь вводит целое положительное число.
Найдите самую большую цифру в числе.
Для решения используйте цикл while и арифметические операции.

"""
"""
number = int(input('Введите целое положительное число\n'))

while number >= 0:
    
"""
a = 121
b = a % 10
print (b)



